const NumberOfDay = prompt("Enter your birthday to know yourself. If your birthday is 4th May then enter 04-05 (DD-MM):  ");

switch (NumberOfDay) {
    case '21-03':
    case '22-03':
    case '23-03':
    case '24-03':
    case '25-03':
    case '26-03':
    case '27-03':
    case '28-03':
    case '29-03':
    case '30-03':
    case '31-03':
    case '01-04':
    case '02-04':
    case '03-04':
    case '04-04':
    case '05-04':
    case '06-04':
    case '07-04':
    case '08-04':
    case '09-04':
    case '10-04':
    case '11-04':
    case '12-04':
    case '13-04':
    case '14-04':
    case '15-04':
    case '16-04':
    case '17-04':
    case '18-04':
    case '19-04':
    case '20-04':

    document.getElementById("demo1").innerHTML = (`
        
    আপনার জন্ম তারিখ ${NumberOfDay} হলে আপনার রাশি মেষ ।
মেষ রাশির জাতক-জাতিকাদের আচরণে একেবারেই জটিলতা থাকে না। সরাসরি কাজ করতে কিংবা কথা বলতে পছন্দ করেন। তবে অপ্রয়োজনীয় কিছু সমস্যার জেরে কখনও কখনও তাঁরা তীব্র হতাশায় ভুগে থাকেন। দ্রুত কাজ এঁদের অত্যন্ত পছন্দের। মেষ হল কার্ডিনাল সাইন। জ্যোতিষবিদদের মতে, প্রতিটি রাশিই তার আগের রাশির থেকে ভাল এবং মন্দ উভয় শিক্ষাই নিয়ে থাকে। আবার মেষ রাশির ক্ষেত্রে যদিও উত্তরাধিকারসূত্রে প্রাপ্ত কোনও জ্ঞান থাকে না। তাঁরা মূলত চোখ বন্ধ করে প্রত্যাশা নিয়ে এগিয়ে যান।
`)
    break;
        case '21-04':
        case '22-04':
        case '23-04':
        case '24-04':
        case '25-04':
        case '26-04':
        case '27-04':
        case '28-04':
        case '29-04':
        case '30-04':
        case '01-05':
        case '02-05':
        case '03-05':
        case '04-05':
        case '05-05':
        case '06-05':
        case '07-05':
        case '08-05':
        case '09-05':
        case '10-05':
        case '11-05':
        case '12-05':
        case '13-05':
        case '14-05':
        case '15-05':
        case '16-05':
        case '17-05':
        case '18-05':
        case '19-05':
        case '20-05':
        case '21-05':
        document.getElementById("demo1").innerHTML = (`
        
            আপনার জন্ম তারিখ ${NumberOfDay} হলে আপনার রাশি বৃষ ।
আপনি ধীরস্থির ও সহনশীল। উদার মন মানসিকতার অধিকারী। সহজেই অন্যকে আপন করে নিতে পারেন। কারও কারও ক্ষেত্রে একরোখা বা একগুঁয়ে হতে দেখা যায়। আপনি সবার সাথে ভালো ব্যবহার করতে ভালোবাসেন। অন্যের প্রতি আপনি যত্নশীল ও সমমর্মী। ঘরেবাইরে সব কিছু গুছিয়ে করতে পছন্দ করেন। আপনার এসব গুণের কারণে অনেক মানুষের ভালোবাসা পাবেন।

আপনি জানেন কীভাবে জীবনকে উপভোগ্য করে তুলতে হয়। ব্যক্তিগতভাবে আপনি আত্মনির্ভরশীলতা পছন্দ করেন। শিল্প, সঙ্গীত ও সাংস্কৃতিক কর্মকাণ্ডের প্রতি আগ্রহ থাকতে পারে। লেখালেখিতেও আপনি বেশ ভালো করতে পারেন। বৃষ রাশির জাতক জাতিকারা সাধারণত রান্নায় পারদর্শী হন। সাজসজ্জা ও সৌন্দর্যপ্রীতি এদের সহজাত বৈশিষ্ট্য।

বৃষ রাশির জাতক জাতিকাদের থাইরয়েড গ্ল্যান্ড, গলা, ঘাঁড় ও কণ্ঠস্বর সংক্রান্ত সমস্যা ভুগতে দেখা যায়।

        `)
         break;
        case '22-05':
        case '23-05':
        case '24-05':
        case '25-05':
        case '26-05':
        case '27-05':
        case '28-05':
        case '29-05':
        case '30-05':
        case '31-05':
        case '01-06':
        case '02-06':
        case '03-06':
        case '04-06':
        case '05-06':
        case '06-06':
        case '07-06':
        case '08-06':
        case '09-06':
        case '10-06':
        case '11-06':
        case '12-06':
        case '13-06':
        case '14-06':
        case '15-06':
        case '16-06':
        case '17-06':
        case '18-06':
        case '19-06':
        case '20-06':
        case '21-06':
            document.getElementById("demo1").innerHTML = (`
            
                আপনার জন্ম তারিখ ${NumberOfDay} হলে আপনার রাশি মিথুন ।
আপনি বেশ রসিকতাজ্ঞান সম্পন্ন। বালক স্বভাবের হওয়ার কারণে একজায়গায় বেশি সময় বসে থাকা আপনার জন্য কঠিন। চঞ্চলতা ও কথামালায় চারপাশ মুখরিত করে রাখতে পারেন। ব্যবসায়িক দিক দিয়েও আপনি সাফল্য অর্জন করবেন। অশুভ বুধের প্রভাবে কারও কারও মিথ্যে বলার অভ্যাস থাকতে পারে।

সহজাতভাবে আপনি একজন দক্ষ সংগঠক। একসঙ্গে একাধিক কাজ করার দক্ষতা ও যোগ্যতা দুটোই আপনার মধ্যে রয়েছে। আপনি গল্প করতে খুব পছন্দ করেন। নতুন কোনো পরিবেশে গেলেও অনায়াসে আড্ডা জমিয়ে তুলতে পারেন। আপনার হৃদয় স্নেহ মমতা ও ভালোবাসায় পরিপূর্ণ। ক্রীড়া, সঙ্গীত ও লেখালেখিতে ভালো করতে পারবেন। জ্ঞানার্জনের প্রতি সহজাত আকর্ষণ রয়েছে। বই পড়তে খুবই পছন্দ করেন। সবসময়ই নিজেকে কোনো না কোনো কাজে ব্যস্ত রাখতে পছন্দ করেন। ব্যস্ততার মাঝেও এরা সময়কে সুন্দরভাবে কাজে লাগাতে পারেন। জীবনে অনেক ভ্রমণ করার সুযোগ পাবেন।

মিথুন রাশির জাতক/জাতিকাদের প্রেস, পরিবহন, কুরিয়ার, ইনসিওরেন্স, সংবাদপত্র, আইন কিংবা শিক্ষকতা পেশায় সফল হতে দেখা যায়।

মিথুন রাশির জাতক জাতিকাদের কাঁধ ও হাত, স্নায়ুতন্ত্র ও শ্বাসকষ্ট এবং মস্তিষ্কের পীড়ায় আক্রান্ত হতে দেখা যায়। 
    
            `)
        break;
        case '22-06':
        case '23-06':
        case '24-06':
        case '25-06':
        case '26-06':
        case '27-06':
        case '28-06':
        case '29-06':
        case '30-06':
        case '01-07':
        case '02-07':
        case '03-07':
        case '04-07':
        case '05-07':
        case '06-07':
        case '07-07':
        case '08-07':
        case '09-07':
        case '10-07':
        case '11-07':
        case '12-07':
        case '13-07':
        case '14-07':
        case '15-07':
        case '16-07':
        case '17-07':
        case '18-07':
        case '19-07':
        case '20-07':
        case '21-07':
        case '22-07':
        case '23-07':
            document.getElementById("demo1").innerHTML = (`
            
                আপনার জন্ম তারিখ ${NumberOfDay} হলে আপনার রাশি কর্কট ।
আপনি সাধারণত কোনো ধরনের ঝঞ্ঝাট চান না। পরিবারের প্রতি টান রয়েছে। চাপা স্বভাবের হওয়ার কারণে নিজেকে সামনের দিকে উপস্থাপন করতে চান না। পুরানো রীতিনিতির প্রতি আপনার আকর্ষণ রয়েছে।

আপনি যথেষ্ট কল্পনা প্রবণ ও কর্মঠ। আপনি সব ব্যাপারেই বুঝে শুনে চলেন। সুনির্দিষ্ট লক্ষ্য অর্জনে কাজে লেগে থাকার অসাধারণ গুণ আপনার রয়েছে। আপনার রয়েছে প্রখর স্মৃতিশক্তি।

আপনি পরনির্ভরতা পছ্ন্দ করেন না, আত্মনির্ভরশীল হওয়ার অদম্য ইচ্ছা রয়েছে আপনার। সঙ্গীত ও কলার প্রতি আগ্রহ থাকতে পারে। কর্কট রাশির জাতক জাতিকাদের ইনটুইশন ক্ষমতা প্রবল। অন্যের আবেগ ও অনুভূতি দ্বারা সহজেই প্রভাবিত হন। এরা যথেষ্ট অতিথি পরায়ণ ও আন্তরিক। সেবামূলক কাজে এদের সহজাত আকর্ষণ রয়েছে। অনেক সময় এরা অন্যকে অনুসরণ করার চেয়ে বেশি অনুকরণ করেন। পরবর্তীতে জীবনের হিসেব মিলাতে গিয়ে হতাশাগ্রস্ত হয়ে পড়েন। বাস্তবজীবনে এরা কোমল হৃদয়ের অধিকারী।

কর্কট রাশির জাতক জাতিকাদের বুক, স্তন, পেট ও খাদ্যনালীর সমস্যা থাকতে দেখা যায়। 
            `)
        break;
        
        case '23-07':
        case '24-07':
        case '25-07':
        case '26-07':
        case '27-07':
        case '28-07':
        case '29-07':
        case '30-07':
        case '31-07':
        case '01-08':
        case '02-08':
        case '03-08':
        case '04-08':
        case '05-08':
        case '06-08':
        case '07-08':
        case '08-08':
        case '09-08':
        case '10-08':
        case '11-08':
        case '12-08':
        case '13-08':
        case '14-08':
        case '15-08':
        case '16-08':
        case '17-08':
        case '18-08':
        case '19-08':
        case '20-08':
        case '21-08':
        case '22-08':
        case '23-08':
       
        document.getElementById("demo1").innerHTML = (`
            
আপনার জন্ম তারিখ ${NumberOfDay} হলে আপনার রাশি সিংহ ।
আপনি মহৎ উদার ও স্নেহশীল। আপনার রয়েছে দৃঢ় ইচ্ছাশক্তি। আপনি অন্যের নিকট বিশ্বস্ত ও অধ্যবসায়ী। সবকিছু নিখুঁতভাবে করতে চান। আপনার জেদ ও একরোখা মনোভাবের কারণে অন্যের রোষাণলের শিকার হতে পারেন। আপনি ন্যায় বিচার করতে পছন্দ করেন।

আপনার মধ্যে সাংগঠনিক দক্ষতা ও নেতৃত্বের গুণ রয়েছে। ব্যক্তিজীবনে আপনি কর্মঠ ও আত্মনির্ভরশীল। আপনি নেতৃত্ব দিতে চান। শিল্প, কলা, ক্রীড়া ও সংগীতের প্রতি আকর্ষণ থাকতে পারে। সহজাতভাবে আপনি অতিথি পরায়ণ। কাটছাট কথাবলার কারণে কেউ কেউ আপনাকে ভুল বুঝতে পারে। তবে হৃদয় আপনার ভালোবাসায় পরিপূর্ণ।

সিংহ রাশির জাতকজাতিকাদের বুক, হৃদপিণ্ড ও মেরুদণ্ড সংক্রান্ত সমস্যা থাকতে দেখা যায়। 
            `)
        break;

            case '24-08':
            case '25-08':
            case '26-08':
            case '27-08':
            case '28-08':
            case '29-08':
            case '30-08':
            case '31-08':
            case '01-09':
            case '02-09':
            case '03-09':
            case '04-09':
            case '05-09':
            case '06-09':
            case '07-09':
            case '08-09':
            case '09-09':
            case '10-09':
            case '11-09':
            case '12-09':
            case '13-09':
            case '14-09':
            case '15-09':
            case '16-09':
            case '17-09':
            case '18-09':
            case '19-09':
            case '20-09':
            case '21-09':
            case '22-09':
            case '23-09':
           
            document.getElementById("demo1").innerHTML = (`
                
আপনার জন্ম তারিখ ${NumberOfDay} হলে আপনার রাশি কন্যা ।
আপনি সহজাত বুদ্ধি ও যুক্তির নিরিখে সিদ্ধান্ত নিতে পছন্দ করেন। প্রিয় মানুষের জন্য অকাতরে অনেক ত্যাগ স্বীকার করতে পারেন।

আকর্ষণীয় ব্যক্তিত্বের অধিকারী কন্যা রাশির জাতক জাতিকারা তীক্ষ্ণ স্মৃতিশক্তির অধিকারী হয়ে থাকেন। এরা সচরাচর ভালোবাসার প্রতিদান পান না বলে মনে করেন। যে কারণে প্রায়ই অন্যের ওপর অভিমান করে থাকেন। তবে যাই হোক এরা সবসময় অন্যের সেবায় নিজেকে উৎসর্গ করতে ভালোবাসেন। ভালো কাজে অংশগ্রহণের মাধ্যমে আত্মতৃপ্তি পান। সঙ্গীত, গণিত, যুক্তি ও কর্ম দক্ষতায় এ রাশির জাতক জাতিকারা হন অনন্য। সাংগঠনিক দক্ষতার কারণে এদের ওপর সহজেই গুরুত্বপূর্ণ কাজের দায়িত্ব অর্পন করতে দেখা যায়।

কন্যারাশির জাতক জাতিকাদের পাচনতন্ত্র, প্লীহা, অন্ত্র ও স্নায়ূতন্ত্রের সমস্যায় ভুগতে দেখা যায়।
                `);
                
            break;

            case '24-09':
            case '25-09':
            case '26-09':
            case '27-09':
            case '28-09':
            case '29-09':
            case '30-09':
            case '01-10':
            case '02-10':
            case '03-10':
            case '04-10':
            case '05-10':
            case '06-10':
            case '07-10':
            case '08-10':
            case '09-10':
            case '10-10':
            case '11-10':
            case '12-10':
            case '13-10':
            case '14-10':
            case '15-10':
            case '16-10':
            case '17-10':
            case '18-10':
            case '19-10':
            case '20-10':
            case '21-10':
            case '22-10':
            case '23-10':
               
                document.getElementById("demo1").innerHTML = (`
                    
আপনার জন্ম তারিখ ${NumberOfDay} হলে আপনার রাশি তূলা ।
আপনার পছন্দ সামঞ্জস্যতা ও শৃঙ্খলা। আপনি বৈষম্য পছন্দ করেন না। খুব সহজেই মানুষকে আপন করে নেওয়ার মতো অসাধারণ গুণ আপনার রয়েছে। নতুন কোনো পরিবেশে গেলেও সঙ্গী জোগাড় করে নেওয়া আপনার জন্যে ব্যাপার না। এ রাশির জাতক/জাতিকাদের সঙ্গীত, ক্রীড়া কিংবা লেখালেখিতে ভালো করতে দেখা যায়। 

তুলা রাশির জাতক/জাতিকারা সাধারণত সুদর্শন ও সৌন্দর্যের পূজারি হয়। বাহ্যিক অবয়বে কারও কারও চুল কোকড়া হতে পারে। এর সাধারণত রোমান্টিক ও বুদ্ধিমান হয়ে থাকেন। সহজেই অন্যের সঙ্গে মিশতে পারেন। যোগাযোগমূলক কাজে এদের বিশেষ দক্ষতা রয়েছে। এদের পছন্দ সাম্যতা। অন্যায় কর্ম এদের নীতিবিরুদ্ধ। যে কোনো কাজ এরা ধীরে ধীরে করতে পছন্দ করেন। অনেকের ক্ষেত্রেই এ কারণে ভাগ্যোন্নয়ণ বিলম্বিত হয়ে থাকে। কর্মস্থলে এদের মতো মমতাময়ী ও সহযোগী পাওয়া দুষ্কর। অধস্তনদের দক্ষতা উন্নয়ণে এরা গুরুত্বপূর্ণ ভূমিকা পালন করেন।

তুলা রাশির জাতক জাতিকাদের শরীরের দুর্বলতম অঙ্গ হচ্ছে কিডনি, ত্বক, কটিদেশীয় অঞ্চল ও নিতম্ব।
                    `);
                    
        break;

            case '24-10':
            case '25-10':
            case '26-10':
            case '27-10':
            case '28-10':
            case '29-10':
            case '30-10':
            case '31-11':
            case '01-11':
            case '02-11':
            case '03-11':
            case '04-11':
            case '05-11':
            case '06-11':
            case '07-11':
            case '08-11':
            case '09-11':
            case '10-11':
            case '11-11':
            case '12-11':
            case '13-11':
            case '14-11':
            case '15-11':
            case '16-11':
            case '17-11':
            case '18-11':
            case '19-11':
            case '20-11':
            case '21-11':
            case '22-11':
                
                document.getElementById("demo1").innerHTML = (`
                            
        আপনার জন্ম তারিখ ${NumberOfDay} হলে আপনার রাশি বৃশ্চিক ।
আপনি আত্মসংযমী, দৃঢ় প্রতিজ্ঞ ও গোপণীয়তা প্রিয়। নিজের দুঃখ কষ্ট সহজে অন্যকে বুঝতে দেন না। আপনি নিরিবিলি থাকতে বেশি পছন্দ করেন। সুযোগ বুঝে অন্যকে চমকে দিতে পারেন। জীবনের সকল অবস্থায় সততার সাথে প্রতিটি কাজ করতে চান। অতিন্দ্রীয় বিষয়ের প্রতি আগ্রহ থাকতে পারে। দায়িত্ব নেওয়ার মতো সাহস ও ধৈর্য আপনার রয়েছে। তবে একবার চটে গেলে আপনার কথাবার্তা বড় বেশি তীক্ষ্ণ ও কর্কশ হয়ে পড়ে।

বৃশ্চিক রাশির জাতক/জাতিকারা সাধারণত গবেষণামূলক কাজে দক্ষ হয়ে থাকেন। সঙ্গীত, কলা ও লেখালেখির প্রতি এদের সহজাত আকর্ষণ রয়েছে। লেখক হিসেবে এরা বেশ সুনাম কুড়াতে পারেন। এরা যথেষ্ট বুদ্ধিমান হয়ে থাকেন। তবে মাঝেমধ্যে নিজ ভুলে প্রতিকূল পরিস্থিতিতে পড়তে পারেন। প্রেম ও ভালোবাসার ক্ষেত্রেও এরা যথেষ্ট আন্তরিক।

বৃশ্চিক রাশির জাতক জাতিকাদের শরীরের দুর্বলতম অঙ্গ হচ্ছে গর্ভ, প্রজনন ও যৌণ অঙ্গ।
                            `);
                            
     break;

        case '23-11':
        case '24-11':
        case '25-11':
        case '26-11':
        case '27-11':
        case '28-11':
        case '29-11':
        case '30-11':
        case '01-12':
        case '02-12':
        case '03-12':
        case '04-12':
        case '05-12':
        case '06-12':
        case '07-12':
        case '08-12':
        case '09-12':
        case '10-12':
        case '11-12':
        case '12-12':
        case '13-12':
        case '14-12':
        case '15-12':
        case '16-12':
        case '17-12':
        case '18-12':
        case '19-12':
        case '20-12':
        case '21-12':
    
            
    document.getElementById("demo1").innerHTML = (`
                        
    আপনার জন্ম তারিখ ${NumberOfDay} হলে আপনার রাশি ধনু।
সনাতন ধারণার পাশাপাশি বিজ্ঞান ও দর্শনের প্রতি আপনার আগ্রহ রয়েছে। আবেগ বা কল্পনা নয় বাস্তবতার নিরিখে আপনি সিদ্ধান্ত নিতে পছন্দ করেন। আপনি ভ্রমণ করতে পছন্দ করেন।

আপনি নতুন কিছু অনায়াসে শিখতে পারেন। আপনি যথেষ্ট ব্যক্তিত্বসম্পন্ন ও প্রকৃত জ্ঞানের অধিকারী। জীবনের অনেক ক্ষে্ত্রে অন্যরা আপনার দর্শন বুদ্ধি ও পরামর্শ অনুসরণ করে। স্রষ্টা সচেতনতা ও পরোপকারের মানসিকতা আপনাকে মানসিক প্রশান্তি দেবে। ব্যক্তিজীবনে আপনি সৎ। অন্যকেও সততা ও ভালো কাজে উৎসাহিত করতে ভালোবাসেন। অসতর্কতা ও অতিরিক্ত উদ্বিগ্নতার ফলে প্রায়ই ভুল বোঝাবুঝির শিকার শিকার হতে পারেন। তবে কারও সমালোচনা ও বিতর্ক করা থেকে বিরত থাকুন।

ধনু রাশির জাতক জাতিকাদের শরীরের দুর্বলতম অঙ্গ হচ্ছে যকৃত ও উরু।
                        `);
                        
      break;

        case '22-12':
        case '23-12':
        case '24-12':
        case '25-12':
        case '26-12':
        case '27-12':
        case '28-12':
        case '29-12':
        case '30-12':
        case '31-12':
        case '01-01':
        case '02-01':
        case '03-01':
        case '04-01':
        case '05-01':
        case '06-01':
        case '07-01':
        case '08-01':
        case '09-01':
        case '10-01':
        case '11-01':
        case '12-01':
        case '13-01':
        case '14-01':
        case '15-01':
        case '16-01':
        case '17-01':
        case '18-01':
        case '19-01':
        case '20-01':
    
            
    document.getElementById("demo1").innerHTML = (`
                        
    আপনার জন্ম তারিখ ${NumberOfDay} হলে আপনার রাশি মকর।
আপনি কিছুটা আরামপ্রিয় ও ধীরস্থির। ব্যক্তিগত, পারিবারিক ও পেশাগত জীবনে এ নিয়ে আপনাকে অনেক চড়াই উৎরাই পার হতে হবে। আপনি আগ বাড়িয়ে নতুন কারও সঙ্গে পরিচিত হওয়া বা সবার সাথে সহজে মিশতে পারেন না। নিজের মধ্যে জড়তা কাজ করে।

আপনি অধ্যবসায়ী, পরিশ্রমী ও স্বাধীনচেতা। জীবনের অনেক ক্ষেত্রেই আপনি সহনশীল ও হিসেবী। জীবনে অনেক চ্যালেঞ্জ মোকাবেলা করেই আপনার সাফল্য এসেছে। আর তাই আপনার জীবনদৃষ্টি অন্যদের চেয়ে আলাদা।

পুরানো রীতিনিতি মেনে চলতে আপনি পছন্দ করেন। নিজেকে সবসময় শুদ্ধ ও নিরাপদ রাখতে চান। আপনার দায়িত্বজ্ঞান ও সচেতনতার ফলে অন্যরা সহজে আপনাকে বিশ্বাস করে। রহস্যজনক বিষয়ের প্রতি আপনার ঝোঁক থাকতে পারে।

এ রাশির জাতক/জাতিকাদের জীবনে সাফল্য অর্জনের জন্য কঠোর পরিশ্রম করতে হয়। সাফল্য সাধারণত বেশি বয়সে আসে। এরা সদা সতর্ক ও হিসেবী হয়ে থাকেন। আরামপ্রিয় বলে অনেক সুযোগ হাতছাড়া হতে পারে। এরা যথেষ্ট কর্মশক্তির অধিকারী। সহজাতভাবে এদের মধ্যে সাংগঠনিক দক্ষতা রয়েছে। মাঝে মধ্যে আর্থিক সংকটের মধ্যে দিনাতিপাত করতে হয়। ভাগ্যোন্নয়ণে এদের কর্মের বিকল্প নেই। নানারকমের প্রতিবন্ধকতা মোকাবেলা করার মাধ্যমে এদেরকে সামনের পথে এগিয়ে চলতে হয়। এরা বাস্তব জীবন সম্পর্কে খুব ভালো ধারণা রাখেন বলে কল্পনায় ভেসে বেড়ান না।

শরীরের দুর্বলতম অঙ্গ হচ্ছে হাঁটু, জয়েন্ট, কংকালতন্ত্র ও রক্তসংবহনতন্ত্র। কারও কারও ক্ষেত্রে পায়ে কোনো ধরনের আঘাতের চিহ্ন কিংবা অসুবিধা থাকতে পারে।

                        `);
                        
      break;

        case '21-01':
        case '22-01':
        case '23-01':
        case '24-01':
        case '25-01':
        case '26-01':
        case '27-01':
        case '28-01':
        case '29-01':
        case '30-01':
        case '31-01':
        case '01-02':
        case '02-02':
        case '03-02':
        case '04-02':
        case '05-02':
        case '06-02':
        case '07-02':
        case '08-02':
        case '09-02':
        case '10-02':
        case '11-02':
        case '12-02':
        case '13-02':
        case '14-02':
        case '15-02':
        case '16-02':
        case '17-02':
        case '18-02':
        case '19-02':
          
    document.getElementById("demo1").innerHTML = (`
                    
আপনার জন্ম তারিখ ${NumberOfDay} হলে আপনার রাশি কুম্ভ।
আপনি যথেষ্ট ধৈর্যশীল ও সতর্ক। একাধিক বিষয়ের প্রতি আপনার আগ্রহ রয়েছে। প্রচলিত নিয়ম ও শৃঙ্খল ভেঙে আপনি নতুন কিছু করতে চান।

আকর্ষণীয় ব্যক্তিত্বের অধিকারী কুম্ভ রাশির জাতক জাতিকারা সাধারণত স্বাধীনচেতা ও পরোপকারী হয়ে থাকেন। নিত্য নতুন আবিষ্কারের প্রতি এদের সহজাত আকর্ষণ রয়েছে। এরা যথেষ্ট পরিশ্রমী। ঘনিষ্ঠ বন্ধুবান্ধবের সংখ্যা খুবই কম হয়ে থাকে। যোগাযোগমূলক কাজে এদের দক্ষতা বিশেষভাবে প্রশংসনীয়। কমবেশি সব বিষয় সম্পর্কে ধারণা রাখার চেষ্টা করেন। অধিকাংশ সময়ই এরা স্বাধীন পেশার প্রতি আগ্রহী হয়ে থাকেন। গতানুগতিক নিয়ম ও শৃঙ্খলার প্রতি এদের তীব্র অসন্তোষ লক্ষ্য করা যায়।

কুম্ভ রাশির জাতক জাতিকাদের শরীরের দুর্বলতম স্থান হচ্ছে হাঁটু ও গোড়ালি। এদের মধ্যে কারও কারও পায়ে আঘাত, মচকানো বা অন্যকোনো সমস্যা থাকতে দেখা যায়। 

                        `);
                        
  break;
        
        case '20-02':
        case '21-02':
        case '22-02':
        case '23-02':
        case '24-02':
        case '25-02':
        case '26-02':
        case '27-02':
        case '28-02':
        case '29-02':
        case '30-02':
        case '01-03':
        case '02-03':
        case '03-03':
        case '04-03':
        case '05-03':
        case '06-03':
        case '07-03':
        case '08-03':
        case '09-03':
        case '10-03':
        case '11-03':
        case '12-03':
        case '13-03':
        case '14-03':
        case '15-03':
        case '16-03':
        case '17-03':
        case '18-03':
        case '19-03':
        case '20-03':
          
    document.getElementById("demo1").innerHTML = (`
                    
আপনার জন্ম তারিখ ${NumberOfDay} হলে আপনার রাশি মীন।
আপনি শান্ত প্রকৃতির। আপনার মধ্যে মানবিক গুণাবলী স্পষ্টভাবে বিদ্যমান। আপনি পরোপকারী, জানেন মানুষকে কীভাবে ভালোবাসতে হয়।

আপনি সদা হাসিখুশি থাকতে পছন্দ করেন। নিজের কষ্ট সহজে অন্যকে বুঝতে দেন না। আপনি ভ্রমণ প্রিয়, দেশ বিদেশের বিভিন্ন স্থানে ঘুরে বেড়াতে আপনি পছন্দ করেন। আচার ব্যবহারে যথেষ্ট আন্তরিকতা ও বন্ধুবৎসল হওয়ায় যে কোনো বয়সিদের সঙ্গে সহজেই মিশতে পারেন। যে কোনো কিছু ঘটার আগে ইনটুইশনের মাধ্যমে তা বুঝতে পারেন। রহস্যজনক বিষয়ের প্রতি আপনার অনুরাগ থাকবে।

এরা সাধারণত ভুল বোঝাবুঝির শিকার হয়ে থাকেন। জলজাতীয় পণ্য, কৃষি ও শিক্ষকতায় পেশায় এদের সফল হতে দেখা যায়্।

এ রাশির জাতক জাতিকাদের পায়ের পাতায় ও আঙুলে সমস্যা থাকতে দেখা যায়। কারও কারও ক্ষেত্রে স্থূলতা, মেদাধিক্য থাকতে পারে। এছাড়াও পায়ের পাতা বেঁকে যাওয়া বা অন্য কোনো ধরনের আঘাত বা অসুবিধা থাকতে পারে।

                        `);
                        
  break;
                
default:
    document.getElementById("demo1").innerHTML = (`Please enter your birthday in correct format. If your birthday is 4th May then enter 04-05 `);
    break;
}